tutorials/AMB2018-02-B/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     additiveFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.004;

deltaT          1e-07;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDi           1;

maxAlphaCo      1;

functions
{
    solidificationData
    {
        libs ("libadditiveFoamFunctionObjects.so");

        type    solidificationData;
        enabled false;

        box     (-1 -1 -1) (1 1 1);
    }

    ExaCA
    {
        libs ("libadditiveFoamFunctionObjects.so");

        type    ExaCA;
        enabled false;

        box     (-5e-5 -0.00025 -0.0002) (0.0025 0.00025 0);
        dx      2.5e-6;
    }

    meltPoolDimensions
    {
        libs ("libadditiveFoamFunctionObjects.so");

        type            meltPoolDimensions;
        enabled         false;

        scanPathAngle   0.0;
    }
}

// ************************************************************************* //
